<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}


}

</style>

<b><center>
    <span style="font-size: 24pt; line-height: 1.2;">COMS W4111: Introduction to Databases</span><br>
    <span style="font-size: 24pt; line-height: 1.2;">Section 002/V02, Spring 2024</span><br>
</center></b>
<br><br>
<i><center>
<span style="font-size: 20pt; line-height: 1.2;">Lecture 6 Examples</span>
</center></i>

__Note:__ Modifying width of cells for wider displays.

# Setup

In [1]:
%load_ext sql

In [2]:
import pymysql

In [3]:
import pandas

In [4]:
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [5]:
conn = pymysql.connect(host="localhost", user="root", password="dbuserdbuser")

In [6]:
from sqlalchemy import create_engine

In [7]:
engine = create_engine("mysql+pymysql://root:dbuserdbuser@localhost")

# Watching Professor Ferguson Write Code

<span style="font-size: 24pt; line-height: 1.2; color: red">WRITE AND FIRST TEST YOUR COMPLEX SQL IN DATAGRIP AND <BR> COPY INTO THE NOTEBOOK.</span><br>
    
    
<span style="font-size: 24pt; line-height: 1.2; color: red">WHY DO I SOMETIMES NOT DO THAT!</span><br>
    
<img src="./wizard.jpeg" width="550px">

## Simple Example

Consider the table ```simple_student.```

```create table if not exists class_example.student_simple
(
    uni             varchar(16)  not null
        primary key,
    last_name       varchar(64)  not null,
    first_name      varchar(64)  not null,
    middle_name     varchar(64)  null,
    preferred_email varchar(128) null,
    default_email   varchar(128) as (concat(`uni`, _utf8mb4'@columbia.edu')),
    constraint student_simple_pk2
        unique (preferred_email)
);```

The database schema should automatically generate the ```uni``` on insert.


The algorithm is:
- compute the new student's initials.
- Determine the number of students in the table with the same initials.
- The new students ```uni``` is the initials and the number of students with the initials plus 1.


For example, ...

In [8]:
%sql use class_example;

%sql select * from student_simple;

 * mysql+pymysql://root:***@localhost
0 rows affected.
 * mysql+pymysql://root:***@localhost
4 rows affected.

[('bb1', 'Baggins', 'Bilbo', None, 'bb@shire.gov', 'bb1@columbia.edu'),
 ('bb2', 'Banner', 'Bruce', None, None, 'bb2@columbia.edu'),
 ('bdb1', 'Brown', 'Brian', 'Duncan', 'cool_dude@somewhere.org', 'bdb1@columbia.edu'),
 ('jas1', 'Smith', 'John', 'Allen', None, 'jas1@columbia.edu')]

The ```uni``` of a new student ```last_name=ballard```, ```first_name=Bruno``` and no middle name should be ```bb3```.


The ```uni``` of a new student ```last_name=Ballard```, ```first_name=Bruno``` and ```middle_name=David``` should be ```bdb2```.


Rely on users and programmers to correctly implement the behavior is fraught with peril. So, we would automate the behavior using a _trigger._ To make the trigger simpler, we can first write a _function_ that computes the next ```uni```.

```
create
    definer = root@localhost function class_example.compute_next_uni(last_name varchar(64), first_name varchar(64),
                                                                     middle_name varchar(64)) returns varchar(16)
    deterministic
begin
    declare first_initial char(1);
    declare last_initial char(1);
    declare middle_initial char(1);
    declare uni_count int;
    declare uni_prefix varchar(3);
    declare result varchar(16);
    declare uni_pattern varchar(4);


    /* uni_count will count the number of UNIs with the same initials. Adding 1 computes the next UNI. */
    set uni_count = 0;

    /* Form a lower case characters of first letter of the last_name, first_name and middle_name */
    set last_initial = lower(substr(last_name,  1, 1));
    set first_initial = lower(substr(first_name,  1, 1));

    /* The middle_name may be NULL. This would convert a concatenated string to NULL. So, if it is NULL,
       replace with the empty character ''/
     */
    set middle_initial = ifnull(lower(substr(middle_name, 1, 1)), '');

    /* The new student's UNI prefix.
       John Doe would have jd
       John Allen Doe would have jad.
       */
    set uni_prefix = concat(first_initial, middle_initial, last_initial);

    /* Adding % forms a pattern that will select all matching UNIs. */
    set uni_pattern = concat(uni_prefix, '%');

    /*
     The behavior is slight different if there is not middle name. jd% should match UNIs like jd11, but
     it would incorrectly match jdf11. So we want a match and the 3rd character to be a number. Otherwise,
     we can just count the matches.
     */
    if length(uni_prefix) = 2 then
        select count(*) into uni_count from student_simple where substr(uni, 3, 1) between '0' and '9'
            and uni like uni_pattern;
    else
        select count(*) into uni_count from student_simple
            where uni like uni_pattern;
    end if;

    /* Compute the next UNI */
    set result = concat(uni_prefix, uni_count+1);

    /* Return the result */
    return result;
end;
```

In [10]:
# A simple test
#
%sql select compute_next_uni("Bucker", "Bill", NULL);

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('bb3',)]

In [11]:
# A simple test
#
%sql select compute_next_uni("Bucker", "Bill", "David");

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('bdb2',)]

The next steps are to define triggers to prevent changes to the UNI by SQL statements.


```
create definer = root@localhost trigger class_example.set_uni
    before insert
    on class_example.student_simple
    for each row
begin
    set new.uni = compute_next_uni(
        new.last_name,
        new.first_name,
        new.middle_name
    );
end;


create definer = root@localhost trigger class_example.update_uni
    before update
    on class_example.student_simple
    for each row
begin
    if old.uni != new.uni then
        signal sqlstate '02000'
            set message_text = "You cannot change the UNI. This is a warning. Ignored.";
        set new.uni = old.uni;
    end if;
end;

```

The code does not issue a warning if the user tries to set a ```uni``` on ```INSERT.```

In [12]:
%%sql

insert into student_simple(first_name, middle_name, last_name, preferred_email)
    values("Bill", "David", "Buckner", "icannotbelieveyoumadethaterror@sox.com")

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [15]:
%sql select * from student_simple;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('bb1', 'Baggins', 'Bilbo', None, 'bb@shire.gov', 'bb1@columbia.edu'),
 ('bb2', 'Banner', 'Bruce', None, None, 'bb2@columbia.edu'),
 ('bdb1', 'Brown', 'Brian', 'Duncan', 'cool_dude@somewhere.org', 'bdb1@columbia.edu'),
 ('bdb2', 'Buckner', 'Bill', 'David', 'icannotbelieveyoumadethaterror@sox.com', 'bdb2@columbia.edu'),
 ('jas1', 'Smith', 'John', 'Allen', None, 'jas1@columbia.edu')]

In [17]:
%%sql

update student_simple set uni='goat' where last_name='Bucker';

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [18]:
%sql select * from student_simple;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('bb1', 'Baggins', 'Bilbo', None, 'bb@shire.gov', 'bb1@columbia.edu'),
 ('bb2', 'Banner', 'Bruce', None, None, 'bb2@columbia.edu'),
 ('bdb1', 'Brown', 'Brian', 'Duncan', 'cool_dude@somewhere.org', 'bdb1@columbia.edu'),
 ('bdb2', 'Buckner', 'Bill', 'David', 'icannotbelieveyoumadethaterror@sox.com', 'bdb2@columbia.edu'),
 ('jas1', 'Smith', 'John', 'Allen', None, 'jas1@columbia.edu')]